{
  "id": "captain",
  "name": {
    "zh": "船長",
    "en": "Captain"
  },
  "appearance": {
    "breed": "虎斑家貓，棕黑色經典虎斑紋",
    "body": "結實壯碩，寬胸厚肩，大骨架，是四隻裡最大隻的",
    "face": "方正的臉，額頭有明顯的 M 字虎斑紋，表情永遠帶著堅毅",
    "fur_pattern": "深棕色底配黑色粗條紋虎斑，胸前和下巴是白色（像穿了白襯衫），四隻腳掌都是白色（白手套）",
    "distinctive_features": [
      "左眼戴著深色眼罩（受過傷），右眼是銳利的翠綠色",
      "脖子上圍著一條褪色的紅色頭巾（bandana）",
      "左耳有明顯的 V 型缺口（戰鬥痕跡）",
      "鬍鬚又長又白，像老船長的大鬍子一樣威風",
      "毛有點蓬亂粗糙，不修邊幅的帥",
      "尾巴粗壯，像船舵一樣穩重"
    ],
    "size": "大型，壯碩結實"
  },
  "personality": {
    "traits": [
      "勇敢",
      "粗獷",
      "講義氣",
      "沉穩",
      "偶爾霸氣外露"
    ],
    "quirks": [
      "喜歡站在最高處吹風",
      "看到魚會瞬間失去所有威嚴",
      "下雨天會默默幫小貓遮雨"
    ],
    "voice": "低沉、粗獷、但有時意外溫柔"
  },
  "visual_prompt_snippet": "CRITICAL: large STOCKY BROWN tabby with bold BLACK stripes; ALWAYS VISIBLE dark eye patch covering LEFT eye; ALWAYS VISIBLE single EMERALD GREEN RIGHT eye; ALWAYS VISIBLE V-shaped notch in LEFT ear; ALWAYS VISIBLE faded RED bandana. MUST-HAVE CHECKLIST for this cat: (1) large stocky brown tabby cat with bold black stripes, (2) ALWAYS VISIBLE dark eye patch covering the LEFT eye completely, (3) ALWAYS VISIBLE one piercing emerald green RIGHT eye, (4) ALWAYS VISIBLE prominent V-shaped notch cut from the LEFT ear, (5) ALWAYS VISIBLE faded red bandana/neckerchief tied around the neck, (6) clear M-mark on forehead, (7) white chest bib and white mitten paws, (8) scruffy rough fur - not groomed or sleek, (9) thick sturdy tail. NEGATIVE/NEVER: no two visible eyes, no clean/pristine coat, no missing bandana, no missing ear notch, no smooth glossy fur, no orange/grey tabby colors. REPEAT CRITICAL: brown tabby with black stripes, LEFT eye patch, single EMERALD GREEN right eye, LEFT ear V-notch, faded RED bandana.",
  "story_context": "船長是港口碼頭的老大，沒有貓知道牠的眼睛是怎麼受傷的，但每隻貓都尊敬牠。牠年輕時據說搭過漁船出海，現在退休在碼頭巡邏，守護這片水域的貓群。叫牠「船長」是因為牠走路的樣子真的像在甲板上踱步。",
  "preferred_settings": [
    "漁港碼頭",
    "燈塔",
    "船艙",
    "海邊防波堤",
    "魚市場",
    "雨中的巷弄",
    "老酒吧"
  ],
  "seasonal_variants": {
    "spring": "在碼頭邊看漁船出海，海風吹動微亂的毛",
    "summer": "戴著草帽在防波堤上釣魚",
    "autumn": "在燈塔旁看夕陽，楓葉飄過海面",
    "winter": "穿著迷你航海外套，在風雪中守護碼頭"
  },
  "appearances": 3,
  "last_appeared": "2026-02-10 20:07 UTC",
  "created_at": "2026-02-09"
}
